Revit 2027 API
FormUtils Class
 Define Form utility functions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FormUtils
Public NotInheritable Class FormUtils
public ref class FormUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FormUtils = class end
The FormUtils type exposes the following members.
Methods
Name | Description
CanBeDissolved |  Validates that input contains one or more form elements or geom combinations containing form elements.
DissolveForms(Document, ICollection<ElementId>) |  Dissolves a collection of form elements into their defining elements.
DissolveForms(Document, ICollection<ElementId>, ICollection<ElementId>) |  Dissolves a collection of form elements into their defining elements.
Top
See Also
Reference
Autodesk.Revit.DB Namespace